# 14 АТ-202
# 15 125
INSERT INTO timetable (group_id, lesson_room_id, lesson_week,
                                  day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(14, 15, 1,
 1, 1, 26 /* Суркова Т.В. */, null, 5 /* Хімія */),
(14, 15, 2,
 1, 1, 26 /* Суркова Т.В. */, null, 5 /* Хімія */),

(14, 15, 1,
 1, 2, 31 /* Слободзян Л.А */, null, 7 /* Укр мова */),
(14, 15, 2,
 1, 2, 34 /* Бондаренко О.П*/ , null, 108 /* Біологія */),

(14, 15, 1,
 1, 3, 51 /* Резерв */, null, 9 /* Всесвіт */),
(14, 15, 2,
 1, 3, 51 /* Резерв */, null, 9 /* Всесвіт */),

(14, 15, 1,
 1, 4, 50 /* Свіцельський М.О. */, null, 26 /* Фіз вих */),
(14, 15, 2,
 1, 4, 50 /* Свіцельський М.О. */, null, 26 /* Фіз вих */),

#        Tuesday
(14, 15, 1,
 2, 2, 48 /* Чорноконь */, null, 109 /* Заруб літ */),
(14, 15, 2,
 2, 2, 48/* Чорноконь */, null, 109 /* Заруб літ */),

(14, 15, 1,
 2, 3, 47 /* Кушнір */, null, 110 /* Захист Вітчизни */),
(14, 15, 2,
 2, 3, 47 /* Кушнір */, null, 110 /* Захист Вітчизни */),


(14, 15, 1,
 2, 4, 48 /* Чорноконь */, null, 109 /* Заруб літ */),
(14, 15, 2,
 2, 4, 48/* Чорноконь */, null, 109 /* Заруб літ */),
#        Wednesday
(14, 15, 1,
 3, 1, 42 /*Дуба*/, null, 6 /* Фізика */),
(14, 15, 2,
 3, 1, 49/*Данилюк*/, null, 106/* Алгебра */),

(14, 15, 1,
 3, 2, 42 /*Дуба*/, null, 6 /* Фізика */),
(14, 15, 2,
 3, 2, 42/*Дуба*/, null, 6/* Фізика */),

(14, 15, 1,
 3, 3, 22 /* Микитюк О.В.*/, 35 /* Чернова В.А. */, 2 /* Іноземна мова */),
(14, 15, 2,
 3, 3, 22 /* Микитюк О.В.*/, 35 /* Чернова В.А. */, 2 /* Іноземна мова */),

#        Thursday
(14, 15, 1,
 4, 1, 42 /*Дуба*/, null, 6 /* Фізика */),
(14, 15, 2,
 4, 1, 42 /*Дуба*/, null, 6 /* Фізика */),

(14, 15, 1,
 4, 2, 49/*Данилюк*/, null, 106/* Алгебра */),
(14, 15, 2,
 4, 2, 49/*Данилюк*/, null, 106/* Алгебра */),

(14, 15, 1,
 4, 3, 21 /* Миколюк М.В */, 43 /* Федосюк Г.В. */, 1 /* Інформатика */),
(14, 15, 2,
 4, 3, 21 /* Миколюк М.В */, 43 /* Федосюк Г.В. */, 1 /* Інформатика */),

#        Friday
(14, 15, 1,
 5, 1, 51 /* Резерв */, null, 9 /* Всесвіт */),
(14, 15, 2,
 5, 1, 51 /* Резерв */, null, 9 /* Всесвіт */),

(14, 15, 1,
 5, 2, 31 /* Слободзян Л.А */, null, 7 /* Укр мова */),
(14, 15, 2,
 5, 2, 31 /* Слободзян Л.А */, null, 7 /* Укр мова */),

(14, 15, 1,
 5, 3, 34 /* Бондаренко О.П*/, null, 108 /* Біологія */),
(14, 15, 2,
 5, 3, 34 /* Бондаренко О.П*/, null, 108 /* Біологія */),


(14, 15, 2,
 5, 4, 50 /* Свіцельський М.О. */, null, 26 /* Фіз вих */)
;
