# ПМ-201 (ауд. 142)  = 11 11
INSERT INTO timetable (group_id, lesson_room_id, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(11, 11, 2,
 1, 1, 34 /* Бондаренко О.П*/ , null, 108 /* Біологія */),
(11, 11, 1,
 1, 1, 41 /* Капітан Г.В */, null, 11 /* Історія України */),

(11, 11, 1,
 1, 2, 11/* Халавчук Ю.С. */, null, 106/* Алгебра */),
(11, 11, 1,
 1, 2, 11/* Халавчук Ю.С. */, null, 106/* Алгебра */),

(11, 11, 1,
 1, 3, 28 /* Кузнєцова Н.Ю */, 45 /* Соломна О.В. */, 2 /* Іноземна мова */),
(11, 11, 2,
 1, 3, 28 /* Кузнєцова Н.Ю */, 45 /* Соломна О.В. */, 2 /* Іноземна мова */),

(11, 11, 1,
 3, 1, 52 /* Палій Н.В. */, null, 6 /* Фізика */),


#        Tuesday
(11, 11, 1,
 2, 1, 41 /* Капітан Г.В */, null, 11 /* Історія України */),
(11, 11, 2,
 2, 1, 41 /* Капітан Г.В */, null, 11 /* Історія України */),

(11, 11, 1,
 2, 2, 40 /* Янков С.В. */, null, 3 /* Фізична культура */),
(11, 11, 2,
 2, 2, 40 /* Янков С.В. */, null, 3 /* Фізична культура */),

(11, 11, 1,
 2, 3, 7 /* Бойченко І.В */, null, 4 /* Географія */),
(11, 11, 2,
 2, 3, 7/* Бойченко І.В */, null, 4 /* Географія */),

(11, 11, 1,
 2, 4, 11/* Халавчук Ю.С. */, null, 106/* Алгебра */),
(11, 11, 2,
 2, 4, 11/* Халавчук Ю.С. */, null, 106/* Алгебра */),


#        Wednesday
(11, 11, 1,
 3, 1, 26/* Суркова Т.В */, null, 5/* Хімія */),
(11, 11, 2,
 3, 1, 20 /* Кілімнік Л.Л. */, null, 7 /* Українська мова */),

(11, 11, 1,
 3, 2,  20 /* Кілімнік Л.Л. */, null, 8 /* Українська літер */),
(11, 11, 2,
 3, 2,  20 /* Кілімнік Л.Л. */, null, 8 /* Українська літер */),

(11, 11, 1,
 3, 3, 22 /* Миколюк О.В. */, 5 /* Мельник В.М */, 1 /* Інформатика */),
(11, 11, 2,
 3, 3, 22 /* Миколюк О.В. */, 5 /* Мельник В.М */, 1 /* Інформатика */),

#        Thursday
(11, 11, 2,
 4, 1, 34 /* Бондаренко О.П*/ , null, 108 /* Біологія */),
(11, 11, 2,
 4, 1, 34 /* Бондаренко О.П*/ , null, 108 /* Біологія */),

(11, 11, 1,
 4, 2, 26 /* Суркова Т.В */, null, 5/* Хімія */),
(11, 11, 1,
 4, 2, 26 /* Суркова Т.В */, null, 5/* Хімія */),

(11, 11, 1,
 4, 3, 52 /* Палій Н.В. */, null, 6 /* Фізика */),
(11, 11, 1,
 4, 3, 52 /* Палій Н.В. */, null, 6 /* Фізика */),

#        Friday
(13, 13, 1,
 5, 1, 47 /* Кушнір */, null, 110 /* Захист Вітчизни */),
(13, 13, 1,
 5, 1, 47 /* Кушнір */, null, 110 /* Захист Вітчизни */),

(11, 11, 2,
 5, 2, 20 /* Кілімнік Л.Л. */, null, 7 /* Українська мова */),
(11, 11, 2,
 5, 2, 20 /* Кілімнік Л.Л. */, null, 7 /* Українська мова */),

(11, 11, 1,
 5, 3, 52 /* Палій Н.В. */, null, 6 /* Фізика */),
(11, 11, 1,
5, 3, 52 /* Палій Н.В. */, null, 6 /* Фізика */),

(11, 11, 1,
 5, 4, 40 /* Янков С.В. */, null, 3 /* Фізична культура */)
;

