# ПІ-201 (ауд.131)  = 4 4
INSERT INTO timetable (group_id, lesson_room_id, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(4, 4, 1,
 1, 1, 24 /* Соломко Л.А.*/ , 22 /* Миколюк О.В. */, 1 /* Інформатика */),
(4, 4, 2,
 1, 1, 22 /* Соломко Л.А.*/ , 24 /* Миколюк О.В. */, 1 /* Інформатика */),

(4, 4, 1,
 1, 2, 25 /* Студницька Л.М. */, null, 106/* Алгебра */),
(4, 4, 2,
 1, 2, 25 /* Студницька Л.М. */, null, 106/* Алгебра */),

(4, 4, 1,
 1, 3, 26/* Суркова Т.В */, null, 5/* Хімія */),
(4, 4, 2,
 1, 3, 26/* Суркова Т.В */, null, 5/* Хімія */),


#        Tuesday
(4, 4, 1,
 2, 1, 3 /* Захватова Л.В */, null, 6 /* Фізика */),
(4, 4, 2,
 2, 1, 3 /* Захватова Л.В */, null, 6 /* Фізика */),

(4, 4, 1,
 2, 2, 25 /* Студницька Л.М. */, null, 106/* Алгебра */),
(4, 4, 2,
 2, 2, 25 /* Студницька Л.М. */, null, 106/* Алгебра */),

(4, 4, 1,
 2, 3, 15 /* Лункіна О.М */, null, 11 /* Історія України */),
(4, 4, 2,
 2, 3, 15 /* Лункіна О.М */, null, 11 /* Історія України */),

(4, 4, 1,
 2, 4, 22 /* Миколюк О.В. */, 28 /* Кузнєцова Н.Ю */, 2 /* Іноземна мова */),
(4, 4, 2,
 2, 4, 22 /* Миколюк О.В. */, 28 /* Кузнєцова Н.Ю */, 2 /* Іноземна мова */),


#        Wednesday
(4, 4, 1,
 3, 1, 29 /* Даценко Л.І. */, null, 7 /* Українська мова */),
(4, 4, 2,
 3, 1, 29 /* Даценко Л.І. */, null, 7 /* Українська мова */),

(4, 4, 1,
 3, 2, 6 /* Малахова Н.Б.  */, null, 10 /* Громадянська освіта */),
(4, 4, 2,
 3, 2, 6 /* Малахова Н.Б.  */, null, 10 /* Громадянська освіта */),

(4, 4, 1,
 3, 3, 29 /* Даценко Л.І.  */, null, 8 /* Українська література */),
(4, 4, 2,
 3, 3, 29 /* Даценко Л.І.  */, null, 8 /* Українська література */),


#        Thursday
(4, 4, 1,
 4, 1, 6 /* Малахова Н.Б.  */, null, 10 /* Громадянська освіта */),
(4, 4, 2,
 4, 1, 6 /* Малахова Н.Б.  */, null, 10 /* Громадянська освіта */),

(4, 4, 1,
 4, 2, 3 /* Захватова Л.В */, null, 6 /* Фізика */),
(4, 4, 2,
 4, 2, 3 /* Захватова Л.В */, null, 6 /* Фізика */),

(4, 4, 1,
 4, 3, 25 /* Студницька Л.М. */, null, 106/* Алгебра */),
(4, 4, 2,
 4, 3, 25 /* Студницька Л.М. */, null, 106/* Алгебра */),

(4, 4, 1,
 4, 4, 26/* Суркова Т.В */, null, 5/* Хімія */),
(4, 4, 2,
 4, 4, 24 /* Соломко Л.А.*/ , 22 /* Миколюк О.В. */, 1 /* Інформатика */),

#        Friday
(4, 4, 1,
 5, 1, 30 /* Бельський А.В. */, null, 3 /* Фізична культура */),
(4, 4, 2,
 5, 1, 30 /* Бельський А.В. */, null, 3 /* Фізична культура */),

(4, 4, 1,
 5, 2, 15 /* Лункіна О.М */, null, 11 /* Історія України */),
(4, 4, 2,
 5, 2, 15 /* Лункіна О.М */, null, 11 /* Історія України */)
;




