# ПІ-201 (ауд.131)  = 4 4
INSERT INTO timetable (group_id, lesson_room_id, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday

(4, 4, 2,
 1, 1, 52 /* Палій Н.В. */, null, 6 /* Фізика */),

(4, 4, 1,
 1, 2, 34 /* Бондаренко О.П*/ , null, 108 /* Біологія */),
(4, 4, 2,
 1, 2, 20 /* Кілімнік Л.Л. */, null, 7 /* Українська мова */),

(4, 4, 1,
 1, 3, 20 /* Кілімнік Л.Л. */, null, 8 /* Українська літер */),
(4, 4, 2,
 1, 3, 20 /* Кілімнік Л.Л. */, null, 8 /* Українська літер */),

(4, 4, 1,
 1, 4, 22 /* Миколюк О.В. */, 5 /* Мельник В.М */, 1 /* Інформатика */),
(4, 4, 2,
 1, 4, 22 /* Миколюк О.В. */, 5 /* Мельник В.М */, 1 /* Інформатика */),


#        Tuesday
(4, 4, 1,
 2, 1, 40 /* Янков С.В. */, null, 3 /* Фізична культура */),
(4, 4, 2,
 2, 1, 40 /* Янков С.В. */, null, 3 /* Фізична культура */),

(4, 4, 1,
 2, 2, 41 /* Капітан Г.В */, null, 11 /* Історія України */),
(4, 4, 2,
 2, 2, 41 /* Капітан Г.В */, null, 11 /* Історія України */),

(4, 4, 1,
 2, 3, 34 /* Бондаренко О.П*/ , null, 108 /* Біологія */),
(4, 4, 2,
 2, 3, 34 /* Бондаренко О.П*/ , null, 108 /* Біологія */),

(4, 4, 1,
 2, 4, 7 /* Бойченко І.В */, null, 4 /* Географія */),
(4, 4, 2,
 2, 4, 7/* Бойченко І.В */, null, 4 /* Географія */),


#        Wednesday
(4, 4, 1,
 3, 1, 41 /* Капітан Г.В */, null, 11 /* Історія України */),
(4, 4, 2,
 3, 1, 26/* Суркова Т.В */, null, 5/* Хімія */),

(4, 4, 1,
 3, 2, 11/* Халавчук Ю.С. */, null, 106/* Алгебра */),
(4, 4, 2,
 3, 2, 11/* Халавчук Ю.С. */, null, 106/* Алгебра */),

(4, 4, 1,
 3, 3, 52 /* Палій Н.В. */, null, 6 /* Фізика */),
(4, 4, 2,
 3, 3, 52 /* Палій Н.В. */, null, 6 /* Фізика */),


#        Thursday
(4, 4, 1,
 4, 1, 28 /* Кузнєцова Н.Ю */, 45 /* Соломна О.В. */, 2 /* Іноземна мова */),
(4, 4, 2,
 4, 1, 28 /* Кузнєцова Н.Ю */, 45 /* Соломна О.В. */, 2 /* Іноземна мова */),

(4, 4, 1,
 4, 2, 11/* Халавчук Ю.С. */, null, 106/* Алгебра */),
(4, 4, 2,
 4, 2, 11/* Халавчук Ю.С. */, null, 106/* Алгебра */),

(4, 4, 1,
 4, 3, 26 /* Суркова Т.В */, null, 5/* Хімія */),
(4, 4, 2,
 4, 3, 26 /* Суркова Т.В */, null, 5/* Хімія */),


#        Friday
(4, 4, 1,
 5, 1, 20 /* Кілімнік Л.Л. */, null, 7 /* Українська мова */),
(4, 4, 2,
 5, 1, 20 /* Кілімнік Л.Л. */, null, 7 /* Українська мова */),

(4, 4, 1,
 5, 2, 52 /* Палій Н.В. */, null, 6 /* Фізика */),
(4, 4, 2,
 5, 2, 52 /* Палій Н.В. */, null, 6 /* Фізика */),

(13, 13, 1,
 5, 3, 47 /* Кушнір */, null, 110 /* Захист Вітчизни */),
(13, 13, 2,
 5, 3, 47 /* Кушнір */, null, 110 /* Захист Вітчизни */),

(4, 4, 2,
 5, 4, 40 /* Янков С.В. */, null, 3 /* Фізична культура */)
;





