# ПІ-202 (ауд.134а)  = 5 5
INSERT INTO timetable (group_id, lesson_room_id, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(5, 5, 1,
 1, 1, 29 /* Даценко Л.І. */, null, 7 /* Українська мова */),
(5, 5, 2,
 1, 1, 29 /* Даценко Л.І. */, null, 7 /* Українська мова */),

(5, 5, 1,
 1, 2, 24 /* Соломко Л.А.*/ , 22 /* Миколюк О.В. */, 1 /* Інформатика */),
(5, 5, 2,
 1, 2, 22 /* Соломко Л.А.*/ , 24 /* Миколюк О.В. */, 1 /* Інформатика */),

(5, 5, 1,
 1, 3, 29 /* Даценко Л.І.  */, null, 8 /* Українська література */),
(5, 5, 2,
 1, 3, 29 /* Даценко Л.І.  */, null, 8 /* Українська література */),

(5, 5, 1,
 1, 4, 26/* Суркова Т.В */, null, 5/* Хімія */),
(5, 5, 2,
 1, 4, 26/* Суркова Т.В */, null, 5/* Хімія */),


#        Tuesday
(5, 5, 1,
 2, 2, 3 /* Захватова Л.В */, null, 6 /* Фізика */),
(5, 5, 2,
 2, 2, 3 /* Захватова Л.В */, null, 6 /* Фізика */),

(5, 5, 1,
 2, 3, 22 /* Миколюк О.В. */, 28 /* Кузнєцова Н.Ю */, 2 /* Іноземна мова */),
(5, 5, 2,
 2, 3, 22 /* Миколюк О.В. */, 28 /* Кузнєцова Н.Ю */, 2 /* Іноземна мова */),


#        Wednesday
(5, 5, 1,
 3, 2, 25 /* Студницька Л.М. */, null, 106/* Алгебра */),
(5, 5, 2,
 3, 2, 25 /* Студницька Л.М. */, null, 106/* Алгебра */),
(5, 5, 1,
 3, 3, 15 /* Лункіна О.М */, null, 11 /* Історія України */),
(5, 5, 2,
 3, 3, 15 /* Лункіна О.М */, null, 11 /* Історія України */),


#        Thursday
(5, 5, 1,
 4, 1, 3 /* Захватова Л.В */, null, 6 /* Фізика */),
(5, 5, 2,
 4, 1, 3 /* Захватова Л.В */, null, 6 /* Фізика */),

(5, 5, 1,
 4, 2, 6 /* Малахова Н.Б.  */, null, 10 /* Громадянська освіта */),
(5, 5, 2,
 4, 2, 6 /* Малахова Н.Б.  */, null, 10 /* Громадянська освіта */),

(5, 5, 1,
 4, 3, 25 /* Студницька Л.М. */, null, 106/* Алгебра */),
(5, 5, 2,
 4, 3, 25 /* Студницька Л.М. */, null, 106/* Алгебра */),

(5, 5, 2,
 4, 4, 24 /* Соломко Л.А.*/ , 22 /* Миколюк О.В. */, 1 /* Інформатика */),
(5, 5, 1,
 4, 4, 26/* Суркова Т.В */, null, 5/* Хімія */),


#        Friday
(5, 5, 1,
 5, 1, 15 /* Лункіна О.М */, null, 11 /* Історія України */),
(5, 5, 2,
 5, 1, 15 /* Лункіна О.М */, null, 11 /* Історія України */),

(5, 5, 1,
 5, 2, 30 /* Бельський А.В. */, null, 3 /* Фізична культура */),
(5, 5, 2,
 5, 2, 30 /* Бельський А.В. */, null, 3 /* Фізична культура */),

(5, 5, 1,
 5, 3, 25 /* Студницька Л.М. */, null, 106/* Алгебра */),
(5, 5, 2,
 5, 3, 25 /* Студницька Л.М. */, null, 106/* Алгебра */),

(5, 5, 1,
 5, 4, 6 /* Малахова Н.Б.  */, null, 10 /* Громадянська освіта */),
(5, 5, 2,
 5, 4, 6 /* Малахова Н.Б.  */, null, 10 /* Громадянська освіта */)
;




