# МЕ-201 (ауд.129)   = 6 6
INSERT INTO timetable (group_id, lesson_room_id, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(6, 6, 1,
 1, 1, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),
(6, 6, 2,
 1, 1, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),

(6, 6, 1,
 1, 2, 22 /* Миколюк О.В. */, 5 /* Мельник В.М */, 1 /* Інформатика */),
(6, 6, 2,
 1, 2, 22 /* Миколюк О.В. */, 5 /* Мельник В.М */, 1 /* Інформатика */),

(6, 6, 1,
 1, 3, 31 /* Слободзян Л.А */, null, 7 /* Укр мова */),
(6, 6, 2,
 1, 3, 31 /* Слободзян Л.А */, null, 7 /* Укр мова */),

(6, 6, 1,
 1, 4, 31 /* Слободзян Л.А */, null, 8 /* Українська література */),
(6, 6, 2,
 1, 4, 31 /* Слободзян Л.А */, null, 8 /* Українська література */),


#        Tuesday
(6, 6, 1,
 2, 1, 32 /* Козубець О.І */, null, 111 /* Математика */),
(6, 6, 2,
 2, 1, 32 /* Козубець О.І */, null, 111 /* Математика */),

(6, 6, 1,
 2, 2, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),
(6, 6, 2,
 2, 2, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),

(6, 6, 1,
 2, 3, 19 /* Перетятко І.М. */, null, 6 /* Фізика */),
(6, 6, 2,
 2, 3, 19 /* Перетятко І.М. */, null, 6 /* Фізика */),

(6, 6, 1,
 2, 4, 10 /* Роїк Н.М */, null, 5/* Хімія */),
(6, 6, 2,
 2, 4, 34 /* Бондаренко О.П */ , null, 108 /* Біологія */),


#        Wednesday
(6, 6, 1,
 3, 1, 15 /* Лункіна О.М */, null, 11 /* Історія України */),
(6, 6, 2,
 3, 1, 15 /* Лункіна О.М */, null, 11 /* Історія України */),

(5, 5, 1,
 3, 2, 35 /* Чернова В.А. */, 28 /* Кузнєцова Н.Ю */, 2 /* Іноземна мова */),
(5, 5, 2,
 3, 2, 35 /* Чернова В.А. */, 28 /* Кузнєцова Н.Ю */, 2 /* Іноземна мова */),

(6, 6, 1,
 3, 3, 32 /* Козубець О.І */, null, 111 /* Математика */),
(6, 6, 2,
 3, 3, 32 /* Козубець О.І */, null, 111 /* Математика */),


#        Thursday
(6, 6, 1,
 4, 2, 34 /* Бондаренко О.П */ , null, 108 /* Біологія */),
(6, 6, 2,
 4, 2, 34 /* Бондаренко О.П */ , null, 108 /* Біологія */),

(6, 6, 1,
 4, 3, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),
(6, 6, 2,
 4, 3, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),

(6, 6, 1,
 4, 4, 10 /* Роїк Н.М */, null, 5/* Хімія */),
(6, 6, 2,
 4, 4, 10 /* Роїк Н.М */, null, 5/* Хімія */),


#        Friday
(6, 6, 1,
 5, 1, 36 /* Пахолюк О.В.  */, null, 3 /* Фізична культура */),
(6, 6, 2,
 5, 1, 36 /* Пахолюк О.В.  */, null, 3 /* Фізична культура */),

(6, 6, 1,
 5, 2, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),
(6, 6, 2,
 5, 2, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */)
;




