# МЕ-202 (ауд.121)    = 7 7
INSERT INTO timetable (group_id, lesson_room_id, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(7, 7, 1,
 1, 1, 22 /* Миколюк О.В. */, 5 /* Мельник В.М */, 1 /* Інформатика */),
(7, 7, 2,
 1, 1, 22 /* Миколюк О.В. */, 5 /* Мельник В.М */, 1 /* Інформатика */),

(7, 7, 1,
 1, 2, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),
(7, 7, 2,
 1, 2, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),

(7, 7, 1,
 1, 3, 10 /* Роїк Н.М */, null, 5/* Хімія */),
(7, 7, 2,
 1, 3, 10 /* Роїк Н.М */, null, 5/* Хімія */),


#        Tuesday
(7, 7, 1,
 2, 1, 29 /* Даценко Л.І. */, null, 8 /* Українська література */),
(7, 7, 2,
 2, 1, 29 /* Даценко Л.І. */, null, 8 /* Українська література */),

(7, 7, 1,
 2, 2, 31 /* Слободзян Л.А */, null, 7 /* Укр мова */),
(7, 7, 2,
 2, 2, 31 /* Слободзян Л.А */, null, 7 /* Укр мова */),

(7, 7, 1,
 2, 3, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),
(7, 7, 2,
 2, 3, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),

(7, 7, 1,
 2, 4, 34 /* Бондаренко О.П */ , null, 108 /* Біологія */),
(7, 7, 2,
 2, 4, 10 /* Роїк Н.М */, null, 5/* Хімія */),



#        Wednesday
(5, 5, 1,
 3, 1, 35 /* Чернова В.А. */, 28 /* Кузнєцова Н.Ю */, 2 /* Іноземна мова */),
(5, 5, 2,
 3, 1, 35 /* Чернова В.А. */, 28 /* Кузнєцова Н.Ю */, 2 /* Іноземна мова */),

(7, 7, 1,
 3, 2, 15 /* Лункіна О.М */, null, 11 /* Історія України */),
(7, 7, 2,
 3, 2, 15 /* Лункіна О.М */, null, 11 /* Історія України */),

(7, 7, 1,
 2, 3, 11 /* Халавчук Ю.С */, null, 111 /* Математика */),
(7, 7, 2,
 2, 3, 11 /* Халавчук Ю.С */, null, 111 /* Математика */),


#        Thursday
(7, 7, 1,
 4, 1, 19 /* Перетятко І.М. */, null, 6 /* Фізика */),
(7, 7, 2,
 4, 1, 19 /* Перетятко І.М. */, null, 6 /* Фізика */),

(7, 7, 1,
 4, 2, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),
(7, 7, 2,
 4, 2, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),

(7, 7, 1,
 4, 3, 34 /* Бондаренко О.П */ , null, 108 /* Біологія */),
(7, 7, 2,
 4, 3, 34 /* Бондаренко О.П */ , null, 108 /* Біологія */),



#        Friday
(7, 7, 1,
 5, 1, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),
(7, 7, 2,
 5, 1, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),

(7, 7, 1,
 5, 2, 36 /* Пахолюк О.В.  */, null, 3 /* Фізична культура */),
(7, 7, 2,
 5, 2, 36 /* Пахолюк О.В.  */, null, 3 /* Фізична культура */),

(7, 7, 1,
 5, 3, 11 /* Халавчук Ю.С */, null, 111 /* Математика */),
(7, 7, 2,
 5, 3, 11 /* Халавчук Ю.С */, null, 111 /* Математика */)
;




