# ЕК-202 (ауд.135а)    = 9 9
INSERT INTO timetable (group_id, lesson_room_id, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(13, 13, 1,
 1, 1, 37 /* Желавська І.А. */, null, 106/* Алгебра */),
(13, 13, 2,
 1, 1, 37 /* Желавська І.А. */, null, 106/* Алгебра */),

(8, 8, 1,
 1, 2, 19 /* Перетятко І.М. */, null, 6 /* Фізика */),
(8, 8, 2,
 1, 2, 19 /* Перетятко І.М. */, null, 6 /* Фізика */),

(8, 8, 1,
 1, 3, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),
(8, 8, 2,
 1, 3, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),

(8, 8, 1,
 1, 4, 10 /* Роїк Н.М */, null, 5/* Хімія */),


#        Tuesday
(8, 8, 1,
 2, 1, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),
(8, 8, 2,
 2, 1, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),

(8, 8, 1,
 2, 2, 38 /* Багас Л.М.  */, null, 11 /* Історія України */),
(8, 8, 2,
 2, 2, 38 /* Багас Л.М.  */, null, 11 /* Історія України */),

(5, 5, 1,
 2, 3, 35 /* Чернова В.А. */, null, 2 /* Іноземна мова */),
(5, 5, 2,
 2, 3, 35 /* Чернова В.А. */, null, 2 /* Іноземна мова */),

(8, 8, 1,
 2, 4, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),
(8, 8, 2,
 2, 4, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),



#        Wednesday
(8, 8, 1,
 3, 1, 10 /* Роїк Н.М */, null, 5/* Хімія */),
(8, 8, 2,
 3, 1, 10 /* Роїк Н.М */, null, 5/* Хімія */),

(8, 8, 1,
 3, 2, 36 /* Пахолюк О.В.  */, null, 3 /* Фізична культура */),
(8, 8, 2,
 3, 2, 36 /* Пахолюк О.В.  */, null, 3 /* Фізична культура */),

(8, 8, 1,
 3, 3, 34 /* Бондаренко О.П */ , null, 108 /* Біологія */),
(8, 8, 2,
 3, 3, 34 /* Бондаренко О.П */ , null, 108 /* Біологія */),


#        Thursday
(8, 8, 1,
 4, 1, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),
(8, 8, 2,
 4, 1, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),

(13, 13, 1,
 4, 2, 37 /* Желавська І.А. */, null, 106/* Алгебра */),
(13, 13, 2,
 4, 2, 37 /* Желавська І.А. */, null, 106/* Алгебра */),

(8, 8, 1,
 4, 3, 39 /* Глега Л.М.  */, null, 7 /* Укр мова */),
(8, 8, 2,
 4, 3, 39 /* Глега Л.М.  */, null, 7 /* Укр мова */),

(8, 8, 1,
 4, 4, 39 /* Глега Л.М.  */, null, 8 /* Українська література */),
(8, 8, 2,
 4, 4, 39 /* Глега Л.М.  */, null, 8 /* Українська література */),



#        Friday
(8, 8, 1,
 5, 1, 34 /* Бондаренко О.П */ , null, 108 /* Біологія */),

(8, 8, 1,
 5, 2, 22 /* Миколюк О.В. */, null, 1 /* Інформатика */),
(8, 8, 2,
 5, 2, 22 /* Миколюк О.В. */, null, 1 /* Інформатика */)
;




