# ЕК-202 (ауд.135а)    = 9 9
INSERT INTO timetable (group_id, lesson_room_id, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(9, 9, 1,
 1, 2, 60 /* Кульбаба С.О. */, null, 7 /* Укр мова */),
(9, 9, 2,
 1, 2, 60 /* Кульбаба С.О. */, null, 7 /* Укр мова */),

(9, 9, 1,
 1, 3, 60 /* Кульбаба С.О. */, null, 8 /* Українська література */),
(9, 9, 2,
 1, 3, 60 /* Кульбаба С.О. */, null, 8 /* Українська література */),

(9, 9, 1,
 1, 4, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),
(9, 9, 2,
 1, 4, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),



#        Tuesday
(9, 9, 1,
 2, 1, 20 /* Кілімнік Л.Л. */, null, 109 /* Зарубіжна література */),
(9, 9, 2,
 2, 1, 20 /* Кілімнік Л.Л. */, null, 109 /* Зарубіжна література */),

(9, 9, 1,
 2, 2, 10 /* Роїк Н.М */, null, 5/* Хімія */),
(9, 9, 2,
 2, 2, 34 /* Бондаренко О.П */ , null, 108 /* Біологія */),

(9, 9, 1,
 2, 3, 40 /* Янков С.В  */, null, 3 /* Фізична культура */),
(9, 9, 2,
 2, 3, 40 /* Янков С.В  */, null, 3 /* Фізична культура */),

(9, 9, 1,
 2, 4, 19 /* Перетятко І.М. */, null, 6 /* Фізика */),
(9, 9, 2,
 2, 4, 19 /* Перетятко І.М. */, null, 6 /* Фізика */),



#        Wednesday
(5, 5, 1,
 3, 1, 27 /* Микитюк О.В */, null, 2 /* Іноземна мова */),
(5, 5, 2,
 3, 1, 27 /* Микитюк О.В */, null, 2 /* Іноземна мова */),

(9, 9, 1,
 3, 2, 34 /* Бондаренко О.П */ , null, 108 /* Біологія */),
(9, 9, 2,
 3, 2, 34 /* Бондаренко О.П */ , null, 108 /* Біологія */),

(9, 9, 1,
 3, 3, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),
(9, 9, 2,
 3, 3, 17 /* Докторук О.Д  */, null, 10 /* Громадянська освіта */),



#        Thursday
(13, 13, 1,
 4, 1, 20 /* Кілімнік Л.Л. */, null, 106/* Алгебра */),
(13, 13, 2,
 4, 1, 20 /* Кілімнік Л.Л. */, null, 106/* Алгебра */),

(13, 13, 1,
 4, 2, 20 /* Кілімнік Л.Л. */, null, 106/* Алгебра */),
(13, 13, 2,
 4, 2, 20 /* Кілімнік Л.Л. */, null, 106/* Алгебра */),

(9, 9, 1,
 4, 3, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),
(9, 9, 2,
 4, 3, 33 /* Салямон О.І. */, null, 109 /* Зарубіжна література */),


#        Friday
(9, 9, 1,
 5, 1, 22 /* Миколюк О.В. */, null, 1 /* Інформатика */),
(9, 9, 2,
 5, 1, 22 /* Миколюк О.В. */, null, 1 /* Інформатика */),

(9, 9, 1,
 5, 2, 10 /* Роїк Н.М */, null, 5/* Хімія */),
(9, 9, 2,
 5, 2, 10 /* Роїк Н.М */, null, 5/* Хімія */),

(9, 9, 1,
 2, 2, 15 /* Лункіна О.М.  */, null, 11 /* Історія України */),
(9, 9, 2,
 2, 2, 15 /* Лункіна О.М.  */, null, 11 /* Історія України */)
;




