# МГ-201 (ауд 124)    = 10 10
INSERT INTO timetable (group_id, lesson_room_id, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(10, 10, 1,
 1, 1,  41 /* Капітан Г.В.   */, null, 11 /* Історія України */),
(10, 10, 2,
 1, 1, 42 /* Дуда Л.О.   */, null, 6 /* Фізика */),

(10, 10, 1,
 1, 2, 41 /* Капітан Г.В.   */, null, 11 /* Історія України */),
(10, 10, 2,
 1, 2, 41 /* Капітан Г.В.   */, null, 11 /* Історія України */),

(10, 10, 1,
 1, 3, 21 /* Миколюк М.В.   */, 43, 1 /* Інформатика  */),
(10, 10, 2,
 1, 3, 21 /* Миколюк М.В.   */, 43, 1 /* Інформатика  */),

(10, 10, 1,
 1, 4,  42 /* Дуда Л.О.   */, null, 6 /* Фізика */),
(10, 10, 2,
 1, 4,  42 /* Дуда Л.О.   */, null, 6 /* Фізика */),



#        Tuesday
(10, 10, 1,
 2, 1, 36 /* Пахолюк О.В */, null, 3 /* Фізична культура */),
(10, 10, 2,
 2, 1, 36 /* Пахолюк О.В */, null, 3 /* Фізична культура */),

(10, 10, 1,
 2, 2, 29 /* Даценко Л.І.  */, null, 7 /* Українська мова */),
(10, 10, 2,
 2, 2,  29 /* Даценко Л.І.  */, null, 7 /* Українська мова */),

(10, 10, 1,
 2, 3, 29 /* Даценко Л.І. */, null, 8 /* Українська література */),
(10, 10, 2,
 2, 3,  29 /* Даценко Л.І. */, null, 8 /* Українська література */),

(10, 10, 1,
 2, 4, 42 /* Дуда Л.О.   */, null, 6 /* Фізика */),
(10, 10, 2,
 2, 4, 42 /* Дуда Л.О.   */, null, 6 /* Фізика */),



#        Wednesday
(10, 10, 1,
 3, 1, 34 /*Бондаренко О.П. */, null, 108 /* Біологія */),
(10, 10, 2,
 3, 1, 34 /*Бондаренко О.П. */, null, 108 /* Біологія */),

(10, 10, 1,
 3, 2, 26 /* Суркова Т.В.  */, null, 5 /* Хімія */),
(10, 10, 2,
 3, 2, 26 /* Суркова Т.В.  */, null, 5 /* Хімія */),

(10, 10, 1,
 3, 3, 7 /* Бойченко І.В. */ , null, 4 /* Географія */),
(10, 10, 2,
 3, 3, 7 /* Бойченко І.В. */ , null, 4 /* Географія */),


#        Thursday

(10, 10, 2,
 4, 1, 26 /* Суркова Т.В.  */, null, 5 /* Хімія */),

(10, 10, 1,
 4, 2, 16 /* Супрун Л.В. */, null, 106/* Алгебра */),
(10, 10, 2,
 4, 2, 16 /* Супрун Л.В. */, null, 106/* Алгебра */),

(10, 10, 1,
 4, 3,42 /* Дуда Л.О.   */, null, 6 /* Фізика */),
(10, 10, 2,
 4, 3,42 /* Дуда Л.О.   */, null, 6 /* Фізика */),

(10, 10, 1,
 4, 4, 44 /* Хібліна К.І  */, 45, 2 /* Іноземна мова */),
(10, 10, 2,
 4, 4, 44 /* Хібліна К.І  */, 45, 2 /* Іноземна мова */),



#        Friday
(10, 10, 1,
 5, 1, 29 /* Даценко Л.І.  */, null, 7 /* Українська мова */),
(10, 10, 2,
 5, 1, 34 /*Бондаренко О.П. */, null, 108 /* Біологія */),

(10, 10, 1,
 5, 2, 47 /* Кушнір В.Л */, null, 110 /* Захист Вітчизни */),
(10, 10, 2,
 5, 2, 47 /* Кушнір В.Л */, null, 110 /* Захист Вітчизни */),


(10, 10, 1,
 5, 3, 16 /* Супрун Л.В. */, null, 106/* Алгебра */),
(10, 10, 2,
 5, 3, 16 /* Супрун Л.В. */, null, 106/* Алгебра */);
;




