INSERT INTO timetable (teacher_id, teacher_id_optional, lesson_id, group_id,
                                  lesson_room_id, lesson_week, lesson_number, day_number)
VALUES (1, 2, 2, 1, 1, 1, 1, 1),
       (1, 2, 2, 1, 1, 2, 1, 1),
       (3, null, 6, 1, 1, 1, 2, 1),
       (3, null, 6, 1, 1, 2, 2, 1),
       (22, 5, 1, 1, 1, 1, 3, 1),
       (22, 5, 1, 1, 1, 2, 3, 1),
       (6, null, 10, 1, 1, 1, 4, 1),
       (6, null, 10, 1, 1, 2, 4, 1),
       (7, null, 4, 1, 1, 1, 1, 2),
       (7, null, 4, 1, 1, 2, 1, 2),
       (8, null, 8, 1, 1, 1, 2, 2),
       (8, null, 8, 1, 1, 2, 2, 2),
       (8, null, 7, 1, 1, 1, 3, 2),
       (8, null, 7, 1, 1, 2, 3, 2),
       (9, null, 3, 1, 1, 1, 1, 3),
       (9, null, 3, 1, 1, 2, 1, 3),
       (51, null, 9, 1, 1, 1, 2, 3),
       (51, null, 9, 1, 1, 2, 2, 3),
       (6, null, 10, 1, 1, 1, 3, 3),
       (6, null, 10, 1, 1, 2, 3, 3),
       (11, null, 106, 1, 1, 1, 1, 4),
       (11, null, 106, 1, 1, 2, 1, 4),
       (22, 5, 1, 1, 16, 1, 2, 4),#repeat second week#
       (10, null, 5, 1, 16, 2, 2, 4),
       (3, null, 6, 1, 1, 1, 3, 4),
       (3, null, 6, 1, 1, 2, 3, 4),
       (51, null, 9, 1, 1, 1, 4, 4),
       (51, null, 9, 1, 1, 2, 4, 4),
       (10, null, 5, 1, 1, 1, 1, 5),
       (10, null, 5, 1, 1, 2, 1, 5),
       (11, null, 106, 1, 1, 1, 2, 5),
       (11, null, 106, 1, 1, 2, 2, 5),
       #Друга група
       #
       #
       #
       #Друга група

       #3group
       #3group
       #3group

