INSERT INTO timetable (group_id, lesson_room_id, lesson_week,
                                  day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(3, 3, 1,
 1, 2, 14 /* Матіяш Т.О. */, null, 9 /* Всесвітня історія*/),
(3, 3, 2,
 1, 2, 14 /* Матіяш Т.О. */, null, 9 /* Всесвітня історія*/),


(3,3,1,
 1,3, 1 /* Ковалець. І.М */ ,2 , 2 /* Іноземна мова */),
(3,3,2,
 1,3, 1 /* Ковалець. І.М */ ,2 , 2 /* Іноземна мова */),


(3,3,1,
 1,4, 1 /* Ковалець. І.М */ ,null , 4 /*Географія*/),
(3,3,2,
 1,4, 1 /* Ковалець. І.М */ ,null , 4 /*Географія*/),

(3,3,1,
 2,1, 19 /* Перетятко І.М */ ,null , 6 /*Фізика*/),
(3,3,2,
 2,1, 19 /* Перетятко І.М */ ,null , 6 /*Фізика*/),


(3,3,1,
 2,2, 20 /* Кілімнік Л.Л */ ,null , 7 /*Українська мова*/),
(3,3,2,
 2,2, 20 /* ККілімнік Л.Л */ ,null , 7 /*Українська мова*/),


(3,3,1,
 2,3,20 /* ККілімнік Л.Л */ ,null , 8 /*Географія*/),
(3,3,2,
 2,3,20 /* ККілімнік Л.Л */ ,null , 8 /*Географія*/),


(3,3,1,
 2,4, 21 /* Миколюк М.В */ ,null , 106 /*Алгебра*/),
(3,3,2,
 2,4, 21 /* Миколюк М.В */ ,null , 106 /*Алгебра*/),


(3,3,1,
 3,1, 22 /* Миколюк О.В */ ,5 , 1 /*inf*/),
(3,3,2,
 3,1, 22 /* Миколюк О.В */ ,5 , 1 /*inf*/),


(3,3,1,
 3,2, 23 /* Ковальчук О.Л. */ ,null , 10 /*Громадянська освіта*/),
(3,3,2,
 3,2, 23 /* Ковальчук О.Л. */ ,null , 10 /*Громадянська освіта*/),


(3,3,1,
 3,3, 9 /* Шимків І.І. */ ,null , 3 /*Фізична культура*/),
(3,3,2,
 3,3, 9 /* Шимків І.І. */ ,null , 3 /*Фізична культура*/),


(3,3,1,
 4,1, 22 /* Миколюк О.В */ ,5 , 1 /*inf*/),
(3,3,2,
 4,1, 10 /* Роїк Н.М */ ,null , 5 /*Хімія*/),


(3,3,1,
 4,2, 19 /* Перетятко І.М */ ,null , 6 /*Фізика*/),
(3,3,2,
 4,2, 19 /* Перетятко І.М */ ,null , 6 /*Фізика*/),

(3,3,1,
 4,3,23 /* Ковальчук О.Л. */ ,null , 10 /*Громадянська освіта*/),
(3,3,2,
 4,3,23 /* Ковальчук О.Л. */ ,null , 10 /*Громадянська освіта*/),

(3,3,1,
 4,4, 14 /* Матіяш Т.О. */, null, 9 /* Всесвітня історія*/),
(3,3,2,
 4,4,14 /* Матіяш Т.О. */, null, 9 /* Всесвітня історія*/),


(3,3,1,
5,2, 21 /* Миколюк М.В */ ,null , 106 /*Алгебра*/),
(3,3,2,
5,2, 21 /* Миколюк М.В */ ,null , 106 /*Алгебра*/),


(3,3,1,
5,3,  10 /* Роїк Н.М */ ,null , 5 /*Хімія*/),
(3,3,2,
5,3, 10 /* Роїк Н.М */ ,null , 5 /*Хімія*/);






