# АТ-201 (ауд.148) = 13 13
INSERT INTO timetable (group_id, lesson_room_id, lesson_week,
                                  day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(13, 13, 1,
 1, 1, 31 /* Слободзян Л.А */, null, 7 /* Укр мова */),
(13, 13, 2,
 1, 1, 34 /* Бондаренко О.П*/ , null, 108 /* Біологія */),

(13, 13, 1,
 1, 2, 26 /* Суркова Т.В. */, null, 5 /* Хімія */),
(13, 13, 2,
 1, 2, 26 /* Суркова Т.В. */, null, 5 /* Хімія */),

(13, 13, 1,
 1, 3, 50 /* Свіцельський М.О. */, null, 26 /* Фіз вих */),
(13, 13, 2,
 1, 3, 50 /* Свіцельський М.О. */, null, 26 /* Фіз вих */),

(13, 13, 1,
 1, 4, 2 /* Даць С.В */, 45 /* Соломна О.В. */, 2 /* Іноземна мова */),
(13, 13, 2,
 1, 4, 2 /* Даць С.В */, 45 /* Соломна О.В. */, 2 /* Іноземна мова */),


#        Tuesday
(13, 13, 1,
 2, 1, 21 /* Миколюк М.В */, 43 /* Федосюк Г.В. */, 1 /* Інформатика */),
(13, 13, 2,
 2, 1, 21 /* Миколюк М.В */, 43 /* Федосюк Г.В. */, 1 /* Інформатика */),

(13, 13, 1,
 2, 2, 47 /* Кушнір */, null, 110 /* Захист Вітчизни */),
(13, 13, 2,
 2, 2, 47 /* Кушнір */, null, 110 /* Захист Вітчизни */),

(13, 13, 1,
 2, 3, 48 /* Чорноконь */, null, 109 /* Заруб літ */),
(13, 13, 2,
 2, 3, 48/* Чорноконь */, null, 109 /* Заруб літ */),

(13, 13, 1,
 2, 4, 15 /* Лункіна О.М.  */, null, 9 /* Всесвіт */),
(13, 13, 2,
 2, 4, 15 /* Лункіна О.М.  */, null, 9 /* Всесвіт */),


#        Wednesday
(13, 13, 1,
 3, 1, 49/*Данилюк*/, null, 106/* Алгебра */),
(13, 13, 2,
 3, 1, 42 /*Дуба*/, null, 6 /* Фізика */),

(13, 13, 1,
 3, 2, 48 /* Чорноконь */, null, 109 /* Заруб літ */),
(13, 13, 2,
 3, 2, 48/* Чорноконь */, null, 109 /* Заруб літ */),

(13, 13, 1,
 3, 3, 42 /*Дуба*/, null, 6 /* Фізика */),
(13, 13, 2,
 3, 3, 42/*Дуба*/, null, 6/* Фізика */),

#        Thursday
(13, 13, 1,
 4, 1, 15 /* Лункіна О.М.  */, null, 9 /* Всесвіт */),
(13, 13, 2,
 4, 1, 15 /* Лункіна О.М.  */, null, 9 /* Всесвіт */),

(13, 13, 1,
 4, 2, 42 /*Дуба*/, null, 6 /* Фізика */),
(13, 13, 2,
 4, 2, 42/*Дуба*/, null, 6/* Фізика */),

(13, 13, 1,
 4, 3, 49/*Данилюк*/, null, 106/* Алгебра */),
(13, 13, 1,
 4, 3, 49/*Данилюк*/, null, 106/* Алгебра */),

#        Friday
(13, 13, 1,
 5, 2, 34 /* Бондаренко О.П*/, null, 108 /* Біологія */),
(13, 13, 2,
 5, 2, 34 /* Бондаренко О.П*/, null, 108 /* Біологія */),

(13, 13, 1,
 5, 3, 31 /* Слободзян Л.А */, null, 7 /* Укр мова */),
(13, 13, 2,
 5, 3, 31 /* Слободзян Л.А */, null, 7 /* Укр мова */),

(13, 13, 1,
 5, 4, 50 /* Свіцельський М.О. */, null, 26 /* Фіз вих */)
;
