# todo create db schema

CREATE SCHEMA IF NOT EXISTS timetable2;

CREATE TABLE timetable2.college_group
(
    id   MEDIUMINT,
    name TEXT,
    PRIMARY KEY (id)
);

CREATE TABLE timetable2.lesson
(
    id   MEDIUMINT,
    name TEXT,
    PRIMARY KEY (id)
);

CREATE TABLE timetable2.teacher
(
    id   MEDIUMINT,
    name TEXT,
    PRIMARY KEY (id)
);


CREATE TABLE timetable2.room
(
    id   MEDIUMINT,
    name TEXT,
    PRIMARY KEY (id)
);

CREATE TABLE timetable2.timetable
(
    id   MEDIUMINT NOT NULL AUTO_INCREMENT,
    teacherId int not null, /*1*/
    teacherIdOptional int  , /*1*/
    lessonId int not null,  /*1*/
    groupId int not null,   /*1*/
    lessonRoomId int,         /*707-22*/
    lessonNumber int,         /*707-22*/
    dayNumber int,           /*Понеділок =1*/
    timeStart text,         /*12:00:00*/
    timeEnd text,           /*14:00:00*/
    lessonWeek int,         /*1*/
    PRIMARY KEY (id)
);


TRUNCATE TABLE timetable2.lesson;
TRUNCATE TABLE timetable2.college_group;
TRUNCATE TABLE timetable2.teacher;


# todo fill tables with data
INSERT INTO timetable2.college_group (id, name)
VALUES (1, 'КІ-201'),
       (2,'КІ-202'),
       (3,'КІ-203'),
       (4,'ПІ-201'),
       (5,'ПІ-202'),
       (6,'МЕ-201'),
       (7,'МЕ-202'),
       (8,'ЕК-201'),
       (9,'ЕК-202'),
       (10,'МГ-201'),
       (11,'ПМ-201'),
       (12,'ПМ-202'),
       (13,'АТ-201'),
       (14,'АТ-202'),
       (15,'КІ-191'),
       (16,'КІ-192'),
       (17,'КІ-193'),
       (18,'ПІ-191'),
       (19,'ПІ-192'),
       (20,'МЕ-191'),
       (21,'МЕ-192'),
       (22,'ЕК-191'),
       (23,'ЕК-192'),
       (24,'МГ-191'),
       (25,'ПМ-191'),
       (26,'ПМ-192'),
       (27,'АТ-191'),
       (28,'АТ-192'),
       (29,'КІ-181'),
       (30,'КІ-182'),
       (31,'КІ-183'),
       (32,'ПІ-181'),
       (33,'ПІ-182'),
       (34,'МЕ-181'),
       (35,'МЕ-182'),
       (36,'ЕК-181'),
       (37,'МГ-181'),
       (38,'ПМ-181'),
       (39,'ПМ-182'),
       (40,'АТ-181'),
       (41,'АТ-182'),
       (42,'КІ-171'),
       (43,'КІ-172'),
       (44,'ПІ-171'),
       (45,'ПІ-172'),
       (46,'МЕ-171'),
       (47,'МЕ-172'),
       (48,'МГ-171'),
       (49,'ПМ-171'),
       (50,'ПМ-172'),
       (51,'АТ-171'),
       (52,'АТ-172');


INSERT INTO timetable2.lesson (id, name)
VALUES (1, 'Інформатика'),
       (2,'Іноземна мова'),
       (3, 'Фізична культура'),
       (4, 'Географія'),
       (5, 'Хімія'),
       (6, 'Фізика'),
       (7, 'Українська Мова'),
       (8, 'Українська література'),
       (9,'Всесвітня історія'),
       (10, 'Громадянська освіта'),
       (11,'Історія України'),
       (12,'Програмування'),
       (13,'Історія державності та культури України'),
       (14,'ТЕМК'),
       (15,'Екологія'),
       (16,'Вища математика'),
       (17,'Комп.дискретна математика'),
       (18,'Основи програмування'),
       (19,'Вступ до І ПЗ'),
       (20,'Архітектура комп"ютерів'),
       (21,'Лінійна алгебра'),
       (22, 'Розміщення продуктивних сил'),
       (23,'Основи психології'),
       (24, 'Історія державності'),
       (25,'Техніка і технологі'),
       (26,'Фізичне виховання'),
       (27, 'Економічна теорія'),
       (28,'Статистика'),
       (29, 'Економіка і фінанси підпр'),
       (30, 'Металорізальні верстати'),
       (31,'Нарисна геометрія'),
       (32,'ТКМ'),
       (33,'Основи проектування заготовок'),
       (34,'Взаємозамінність'),
       (35,'Технічна механіка'),
       (36,'Теор. основи електротехніки'),
       (37,'Автомобіл'),
       (38,'Право'),
       (39,'Креслення'),
       (40,'Обчислювальна техніка'),
       (41,'Вимірювання в аналогових та цифрових пристроях'),
       (42,'Теорія ймовірностей'),
       (43,'Комп"ютерна електроніка'),
       (44,'Структури даних'),
       (45,'Захист інформації'),
       (46,'Моделювання'),
       (47,'Диференційні рівняння'),
       (48,'ООП'),
       (49,'Операційні системи'),
       (50,'Математичні методи'),
       (51,'Бухгалтерський облік'),
       (52,'Організація виробництва'),
       (53,'Економіка підприємства'),
       (54,'Етика ділового спілкування'),
       (55,'Інтелектуальна власність'),
       (56,'Менеджмент'),
       (57,'Планування'),
       (58,'Фінансовий облік'),
       (60,'Основи обробки матеріалів'),
       (61,'Технологічне оснащення'),
       (62,'Філософія'),
       (63,'Загальна електротехніка'),
       (64,'Охорона праці'),
       (65,'Приводи верстатів'),
       (66,'Машинобудівне креслення'),
       (67,'Промислова електроніка'),
       (68,'Основи обробки матеріалів та інструментів'),
       (69,'Електропривод'),
       (70,'Автомобільні двигуни'),
       (71,'Гідр. та пневм сист. автом'),
       (72,'Автомобільні двигуни'),
       (73,'Основи філософських знань'),
       (74,'Електрообладнання автом'),
       (75,'Основи охорони праці'),
       (76,'Політологія'),
       (77,'Комп системи і мережі '),
       (78,'Периферійні пристрої'),
       (79,'Надійність, діагностика'),
       (80,'Конструювання прогр забезпечення'),
       (81,'Архітектура та проектування ПЗ'),
       (82,'Основи командної розробки ПЗ'),
       (83,'Програмування в Інтернет'),
       (84,'Економіка та менеджмент ПІ'),
       (85,'Ліцензування та сертифікація ПП'),
       (86,'Людино-машинна взаємодія'),
       (87,'Фінанси підприємства'),
       (88,'Управління інноваціями'),
       (89,'Інформаційні системи'),
       (90,'Зовнішньоекономічна діяльн підпр'),
       (91,'Господарське право'),
       (92,'Управління персоналом'),
       (93,'Логістика'),
       (94,'Технологія машинобудування'),
       (95,'Комп моделювання'),
       (96,'Технологічні основи програмування'),
       (97,'Осн автоматиз проектування'),
       (98,'Основи управління виробництвом'),
       (99,'Будова і обслуговування верстатів'),
       (100,'Соціологія'),
       (101,'Технологічне оснащення'),
       (102,'Основи автоматизованого проект'),
       (103,'Організація та планув підпр'),
       (104,'ТЕА'),
       (105,'Основи технології ремонту автом'),
       (106,'Будова та налагодження СПУ');



INSERT INTO timetable2.teacher (id, name)
VALUES (1, 'Ковалець. І.М.'),
       (201, 'Стецюк П.П.');


INSERT INTO timetable2.room (id, name)
VALUES (1, '707-22'),
       (2, '707-22');

# dayNumber 1-5
# lessonNumber 1-5
# lessonWeek 1,2
# teacherIdOptional set id teacher if have 2 teacher
INSERT INTO timetable2.timetable (teacherId, teacherIdOptional, lessonId, groupId,
                                  lessonRoomId, lessonWeek, lessonNumber, dayNumber )
VALUES (1, 2, 1,1, 1, 1, 1, 1),
       (1, null, 1,1, 1, 1, 1, 1);


SELECT t.*
FROM timetable2.lesson t
WHERE name like '%янська освіт%'
LIMIT 501;

SELECT t.*
FROM timetable2.room t
WHERE name like '%707%'
LIMIT 501;

SELECT t.*
FROM timetable2.teacher t
WHERE name like '%Ковалець%'
LIMIT 501;


SELECT t.*
FROM timetable2.college_group t
WHERE name like '%201%'
LIMIT 501




