# КІ-171 (ауд.221) = 42 17
INSERT INTO timetable (group_id, lesson_room_id, lesson_room_id_optional, lesson_week,
                        day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(42, 17, null, 1,
 1, 1, 6 /* Малахова Н.Б. */, null, 76 /* Політологія */),
(42, 17, null, 2,
 1, 1, 6 /* Малахова Н.Б. */, null, 76 /* Політологія */),

(42, 17, null, 1,
 1, 2, 9 /* Шимків І.І */, null, 112 /* Фізичне виховання */),
(42, 17, null, 2,
 1, 2, 9 /* Шимків І.І */, null, 112 /* Фізичне виховання */),

(42, 17, null, 1,
 1, 3, 61 /* Безрук В.В. */, null, 77 /* Комп системи і мережі */),
(42, 17, null, 2,
 1, 3, 61 /* Безрук В.В. */, null, 77 /* Комп системи і мережі */),

(42, 17, null, 1,
 1, 4, 61 /* Безрук В.В. */, null, 77 /* Комп системи і мережі */),
(42, 17, null, 2,
 1, 4, 61 /* Безрук В.В. */, null, 77 /* Комп системи і мережі */),



#        Tuesday
(42, 17, null, 1,
 2, 1, 62 /* Ковальчук С.О */, null, 48 /* ООП */),
(42, 17, null, 2,
 2, 1, 63 /* Гетьман Б.І */, null, 78 /* Периферійні пристрої */),

(42, 17, null, 1,
 2, 2, 63 /* Гетьман Б.І. */, null, 79 /* Надійність, діагностика */),
(42, 17, null, 2,
 2, 2, 63 /* Гетьман Б.І. */, null, 79 /* Надійність, діагностика */),

(42, 17, null, 1,
 2, 3, 9 /* Шимків І.І */, null, 112 /* Фізичне виховання */),
(42, 17, null, 2,
 2, 3, 9 /* Шимків І.І */, null, 112 /* Фізичне виховання */),

(42, 17, null, 1,
 2, 4, 64 /* Марчук О.М  */, null, 45 /* Захист інформації */),
(42, 17, null, 2,
 2, 4, 64 /* Марчук О.М  */, null, 45 /* Захист інформації */),



#        Wednesday
(42, 17, null, 1,
 3, 1, 38 /* Багас Л.М. */, null, 73 /* Основи філософських знань */),
(42, 17, null, 2,
 3, 1, 38 /* Багас Л.М. */, null, 73 /* Основи філософських знань */),

(42, 17, null, 1,
 3, 2, 62 /* Ковальчук С.О */, 65 /*Стукан А.М */, 48 /* ООП */),
(42, 17, null, 2,
 3, 2, 62 /* Ковальчук С.О */, 65 /*Стукан А.М */, 48 /* ООП */),

(42, 17, null, 1,
 3, 3, 62 /* Ковальчук С.О */, 65 /*Стукан А.М */, 48 /* ООП */),
(42, 17, null, 1,
 3, 3, 62 /* Ковальчук С.О */, 65 /*Стукан А.М */, 48 /* ООП */),

(42, 17, null, 2,
 3, 4, 6 /* Малахова Н.Б. */, null, 76 /* Політологія */),



#        Thursday
(42, 17, null, 1,
 4, 1, 63 /* Гетьман Б.І. */, null, 79 /* Надійність, діагностика */),
(42, 17, null, 2,
 4, 1, 63 /* Гетьман Б.І. */, null, 79 /* Надійність, діагностика */),

(42, 17, null, 1,
 4, 2, 64 /* Марчук О.М  */, null, 45 /* Захист інформації */),
(42, 17, null, 2,
 4, 2, 64 /* Марчук О.М  */, null, 45 /* Захист інформації */),

(42, 17, null, 1,
 4, 3, 38 /* Багас Л.М. */, null, 73 /* Основи філософських знань */),
(42, 17, null, 2,
 4, 3, 61 /* Безрук В.В. */, null, 77 /* Комп системи і мережі */),



#        Friday
(42, 17, null, 1,
 5, 1, 63 /* Гетьман Б.І */, null, 78 /* Периферійні пристрої */),
(42, 17, null, 2,
 5, 1, 63 /* Гетьман Б.І */, null, 78 /* Периферійні пристрої */),
(42, 17, null, 1,
 5, 2, 64 /* Марчук О.М  */, null, 45 /* Захист інформації */),
(42, 17, null, 2,
 5, 2, 64 /* Марчук О.М  */, null, 45 /* Захист інформації */)
;
