# КІ-173 (ауд.231) = 53 18
INSERT INTO timetable (group_id, lesson_room_id, lesson_room_id_optional, lesson_week,
                        day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(53, 18, null, 1,
 1, 1, 61 /* Безрук В.В. */, null, 77 /* Комп системи і мережі */),
(53, 18, null, 2,
 1, 1, 61 /* Безрук В.В. */, null, 77 /* Комп системи і мережі */),

(53, 18, null, 1,
 1, 2, 61 /* Безрук В.В. */, null, 77 /* Комп системи і мережі */),
(53, 18, null, 2,
 1, 2, 61 /* Безрук В.В. */, null, 77 /* Комп системи і мережі */),

(53, 18, null, 1,
 1, 2, 9 /* Шимків І.І */, null, 112 /* Фізичне виховання */),
(53, 18, null, 2,
 1, 2, 9 /* Шимків І.І */, null, 112 /* Фізичне виховання */),

(53, 18, null, 1,
 1, 4, 62 /* Ковальчук С.О */, 65 /* Стукан А.М */, 48 /* ООП */),
(53, 18, null, 2,
 1, 4, 62 /* Ковальчук С.О */, 65 /* Стукан А.М */, 48 /* ООП */),




#        Tuesday
(53, 18, null, 1,
 2, 2, 9 /* Шимків І.І */, null, 112 /* Фізичне виховання */),
(53, 18, null, 2,
 2, 2, 9 /* Шимків І.І */, null, 112 /* Фізичне виховання */),

(53, 18, null, 1,
 2, 3, 64 /* Марчук О.М  */, null, 45 /* Захист інформації */),
(53, 18, null, 2,
 2, 3, 64 /* Марчук О.М  */, null, 45 /* Захист інформації */),

(53, 18, null, 1,
 2, 4, 62 /* Ковальчук С.О */, 65 /* Стукан А.М */, 48 /* ООП */),
(53, 18, null, 2,
 2, 4, 62 /* Ковальчук С.О */, 65 /* Стукан А.М */, 48 /* ООП */),



#        Wednesday
(53, 18, null, 1,
 3, 1, 38 /* Багас Л.М. */, null, 73 /* Основи філософських знань */),
(53, 18, null, 2,
 3, 1, 38 /* Багас Л.М. */, null, 73 /* Основи філософських знань */),

(53, 18, null, 1,
 3, 2, 6 /* Малахова Н.Б. */, null, 76 /* Політологія */),
(53, 18, null, 2,
 3, 2, 6 /* Малахова Н.Б. */, null, 76 /* Політологія */),

(53, 18, null, 1,
 3, 3, 6 /* Малахова Н.Б. */, null, 76 /* Політологія */),
(53, 18, null, 2,
 3, 3, 63 /* Гетьман Б.І */, null, 78 /* Периферійні пристрої */),




#        Thursday
(53, 18, null, 1,
 4, 1, 64 /* Марчук О.М  */, null, 45 /* Захист інформації */),
(53, 18, null, 2,
 4, 1, 64 /* Марчук О.М  */, null, 45 /* Захист інформації */),

(53, 18, null, 1,
 4, 2, 63 /* Гетьман Б.І */, null, 78 /* Периферійні пристрої */),
(53, 18, null, 2,
 4, 2, 63 /* Гетьман Б.І */, null, 78 /* Периферійні пристрої */),

(53, 18, null, 1,
 4, 3, 61 /* Безрук В.В. */, null, 77 /* Комп системи і мережі */),
(53, 18, null, 2,
 4, 3, 38 /* Багас Л.М. */, null, 73 /* Основи філософських знань */),

(53, 18, null, 2,
 4, 4, 62 /* Ковальчук С.О */, 65 /* Стукан А.М */, 48 /* ООП */),



#        Friday
(53, 18, null, 1,
 5, 1, 64 /* Марчук О.М  */, null, 45 /* Захист інформації */),
(53, 18, null, 2,
 5, 1, 64 /* Марчук О.М  */, null, 45 /* Захист інформації */),

(53, 18, null, 1,
 5, 2, 63 /* Гетьман Б.І. */, null, 79 /* Надійність, діагностика */),
(53, 18, null, 2,
 5, 2, 63 /* Гетьман Б.І. */, null, 79 /* Надійність, діагностика */),

(53, 18, null, 1,
 5, 3, 63 /* Гетьман Б.І. */, null, 79 /* Надійність, діагностика */),
(53, 18, null, 2,
 5, 3, 63 /* Гетьман Б.І. */, null, 79 /* Надійність, діагностика */)
;
