# ПІ-171 (ауд.243а) = 42 17
INSERT INTO timetable (group_id, lesson_room_id, lesson_room_id_optional, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(42, 17, null, 1,
 1, 1, 66 /* Щуцький С.В */, 67 /*  Кондратюк Є.С */, 80 /* Конструювання прогр забезпечення */),
(42, 17, null, 2,
 1, 1, 66 /* Щуцький С.В */, 67 /*  Кондратюк Є.С */, 80 /* Конструювання прогр забезпечення */),

(42, 17, null, 1,
 1, 2, 68 /* Гутник І.І. */, 62 /* Ковальчук С.О */, 81 /* Архітектура та проектування ПЗ */),
(42, 17, null, 2,
 1, 2, 68 /* Гутник І.І. */, 62 /* Ковальчук С.О */, 81 /* Архітектура та проектування ПЗ */),

(42, 17, null, 1,
 1, 3, 66 /* Щуцький С.В. */, 67 /* Кондратюк Є.С */, 77 /* Основи командної розробки ПЗ */),
(42, 17, null, 2,
 1, 3, 66 /* Щуцький С.В. */, 67 /* Кондратюк Є.С */, 77 /* Основи командної розробки ПЗ */),

(42, 17, null, 1,
 1, 4, 69 /* Бєльський А.В. */, null, 112 /* Фізичне виховання */),
(42, 17, null, 2,
 1, 4, 69 /* Бєльський А.В. */, null, 112 /* Фізичне виховання */),


#        Tuesday
(42, 17, null, 1,
 2, 1, 38 /* Багас Л.М. */, null, 73 /* Основи філософських знань */),
(42, 17, null, 2,
 2, 1, 38 /* Багас Л.М. */, null, 73 /* Основи філософських знань */),

(42, 17, null, 1,
 2, 2, 19 /* Перетятко І.М */, null, 64 /* Охорона праці */),
(42, 17, null, 2,
 2, 2, 19 /* Перетятко І.М */, null, 64 /* Охорона праці */),

(42, 17, null, 1,
 2, 3, 62 /* Ковальчук С.О */, null, 79 /* Програмування в Інтернет */),
(42, 17, null, 2,
 2, 3, 62 /* Ковальчук С.О */, null, 79 /* Програмування в Інтернет */),

(42, 17, null, 1,
 2, 4, 70 /* Бодарецька О.М. */, null, 84 /* Економіка та менеджмент ПІ */),
(42, 17, null, 2,
 2, 4, 70 /* Бодарецька О.М. */, null, 84 /* Економіка та менеджмент ПІ */),


#        Wednesday
(42, 17, null, 1,
 3, 1, 71 /* Фримерштейн В.Г. */, null, 85 /* Ліцензування та сертифікація ПП */),
(42, 17, null, 2,
 3, 1, 71 /* Фримерштейн В.Г. */, null, 85 /* Ліцензування та сертифікація ПП */),

(42, 17, null, 1,
 3, 2, 66 /* Щуцький С.В */, 67 /*  Кондратюк Є.С */, 80 /* Конструювання прогр забезпечення */),
(42, 17, null, 2,
 3, 2, 66 /* Щуцький С.В */, 67 /*  Кондратюк Є.С */, 80 /* Конструювання прогр забезпечення */),

(42, 17, null, 1,
 3, 3, 67 /*  Кондратюк Є.С */, 66 /* Щуцький С.В */,  86 /* Людино-машинна взаємодія */),
(42, 17, null, 2,
 3, 3, 67 /*  Кондратюк Є.С */, 66 /* Щуцький С.В */,  86 /* Людино-машинна взаємодія */),


#        Thursday
(42, 17, null, 1,
 4, 3, 38 /* Багас Л.М. */, null, 73 /* Основи філософських знань */),
(42, 17, null, 2,
 4, 3, 66 /* Щуцький С.В */, 67 /*  Кондратюк Є.С */, 80 /* Конструювання прогр забезпечення */),

(42, 17, null, 1,
 3, 4, 66 /* Щуцький С.В. */, 67 /* Кондратюк Є.С */, 77 /* Основи командної розробки ПЗ */),
(42, 17, null, 2,
3, 4, 19 /* Перетятко І.М */, null, 64 /* Охорона праці */),



#        Friday
(42, 17, null, 1,
 5, 1, 68 /* Гутник І.І. */, 62 /* Ковальчук С.О */, 81 /* Архітектура та проектування ПЗ */),
(42, 17, null, 2,
 5, 1, 68 /* Гутник І.І. */, 62 /* Ковальчук С.О */, 81 /* Архітектура та проектування ПЗ */),

(42, 17, null, 1,
 5, 2, 67 /*  Кондратюк Є.С */, 66 /* Щуцький С.В */,  86 /* Людино-машинна взаємодія */),
(42, 17, null, 2,
 5, 2, 67 /*  Кондратюк Є.С */, 66 /* Щуцький С.В */,  86 /* Людино-машинна взаємодія */),

(42, 17, null, 1,
 5, 3, 62 /* Ковальчук С.О */, null, 79 /* Програмування в Інтернет */),
(42, 17, null, 2,
 5, 3, 62 /* Ковальчук С.О */, null, 79 /* Програмування в Інтернет */)

;
