# ПІ-172 (ауд.232) = 45 18
INSERT INTO timetable (group_id, lesson_room_id, lesson_room_id_optional, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(45, 18, null, 1,
 1, 1, 62 /* Ковальчук С.О */, null, 79 /* Програмування в Інтернет */),
(45, 18, null, 2,
 1, 1, 62 /* Ковальчук С.О */, null, 79 /* Програмування в Інтернет */)

(45, 18, null, 1,
 1, 2, 66 /* Щуцький С.В */, 67 /*  Кондратюк Є.С */, 80 /* Конструювання прогр забезпечення */),
(45, 18, null, 2,
 1, 2, 66 /* Щуцький С.В */, 67 /*  Кондратюк Є.С */, 80 /* Конструювання прогр забезпечення */),

(45, 18, null, 1,
 1, 3, 68 /* Гутник І.І. */, 62 /* Ковальчук С.О */, 81 /* Архітектура та проектування ПЗ */),
(45, 18, null, 2,
 1, 3, 68 /* Гутник І.І. */, 62 /* Ковальчук С.О */, 81 /* Архітектура та проектування ПЗ */),

(45, 18, null, 1,
 1, 4, 66 /* Щуцький С.В. */, 67 /* Кондратюк Є.С */, 77 /* Основи командної розробки ПЗ */),
(45, 18, null, 2,
 1, 4, 66 /* Щуцький С.В. */, 67 /* Кондратюк Є.С */, 77 /* Основи командної розробки ПЗ */),


#        Tuesday
(45, 18, null, 1,
 2, 1, 38 /* Багас Л.М. */, null, 73 /* Основи філософських знань */),
(45, 18, null, 2,
 2, 1, 38 /* Багас Л.М. */, null, 73 /* Основи філософських знань */),

(45, 18, null, 1,
 2, 2, 67 /*  Кондратюк Є.С */, 66 /* Щуцький С.В */, 86 /* Людино-машинна взаємодія */),
(45, 18, null, 2,
 2, 2, 67 /*  Кондратюк Є.С */, 66 /* Щуцький С.В */, 86 /* Людино-машинна взаємодія */),

(45, 18, null, 1,
 2, 3, 70 /* Бодарецька О.М. */, null, 84 /* Економіка та менеджмент ПІ */),
(45, 18, null, 2,
 2, 3, 70 /* Бодарецька О.М. */, null, 84 /* Економіка та менеджмент ПІ */),

(45, 18, null, 1,
 2, 4, 69 /* Бєльський А.В. */, null, 112 /* Фізичне виховання */),
(45, 18, null, 2,
 2, 4, 69 /* Бєльський А.В. */, null, 112 /* Фізичне виховання */),


#        Wednesday

(45, 18, null, 1,
 3, 1, 66 /* Щуцький С.В */, 67 /*  Кондратюк Є.С */, 80 /* Конструювання прогр забезпечення */),
(45, 18, null, 2,
 3, 1, 66 /* Щуцький С.В */, 67 /*  Кондратюк Є.С */, 80 /* Конструювання прогр забезпечення */),

(45, 18, null, 1,
 3, 2, 71 /* Фримерштейн В.Г. */, null, 85 /* Ліцензування та сертифікація ПП */),
(45, 18, null, 2,
 3, 2, 71 /* Фримерштейн В.Г. */, null, 85 /* Ліцензування та сертифікація ПП */),

(45, 18, null, 1,
 3, 3, 68 /* Гутник І.І. */, 62 /* Ковальчук С.О */, 81 /* Архітектура та проектування ПЗ */),
(45, 18, null, 2,
 3, 3, 68 /* Гутник І.І. */, 62 /* Ковальчук С.О */, 81 /* Архітектура та проектування ПЗ */),


#        Thursday
(45, 18, null, 1,
 4, 1, 67 /*  Кондратюк Є.С */, 66 /* Щуцький С.В */, 86 /* Людино-машинна взаємодія */),
(45, 18, null, 2,
 4, 1, 67 /*  Кондратюк Є.С */, 66 /* Щуцький С.В */, 86 /* Людино-машинна взаємодія */),

(45, 18, null, 1,
 4, 2, 66 /* Щуцький С.В */, 67 /*  Кондратюк Є.С */, 80 /* Конструювання прогр забезпечення */),
(45, 18, null, 2,
 4, 2, 38 /* Багас Л.М. */, null, 73 /* Основи філософських знань */),

(45, 18, null, 1,
 3, 3, 19 /* Перетятко І.М */, null, 64 /* Охорона праці */),
(45, 18, null, 2,
 3, 3, 66 /* Щуцький С.В. */, 67 /* Кондратюк Є.С */, 77 /* Основи командної розробки ПЗ */),


#        Friday
(45, 18, null, 1,
 5, 1, 19 /* Перетятко І.М */, null, 64 /* Охорона праці */),
(45, 18, null, 2,
 5, 1, 19 /* Перетятко І.М */, null, 64 /* Охорона праці */),

(45, 18, null, 1,
 5, 2, 62 /* Ковальчук С.О */, null, 79 /* Програмування в Інтернет */),
(45, 18, null, 2,
 5, 2, 62 /* Ковальчук С.О */, null, 79 /* Програмування в Інтернет */)
;
