# МЕ-171 (ауд.133) = 46 20
INSERT INTO timetable (group_id, lesson_room_id, lesson_room_id_optional, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(46, 20, null, 1,
 1, 1, 72 /* Кайдановська О.М */, null, 87 /* Фінанси підприємства */),
(46, 20, null, 2,
 1, 1, 72 /* Кайдановська О.М */, null, 87 /* Фінанси підприємства */),

(46, 20, null, 1,
 1, 2, 70 /* Бодарецька О.М */, null, 88 /* Управління інноваціями*/),
(46, 20, null, 2,
 1, 2, 70 /* Бодарецька О.М */, null, 88 /* Управління інноваціями*/),

(46, 20, null, 1,
 1, 3, 70 /* Бодарецька О.М */, null, 88 /* Управління інноваціями */),
(46, 20, null, 2,
 1, 3, 73 /* Качеровська Л.М */, null, 89 /* Інформаційні системи  */),


#        Tuesday
(46, 20, null, 1,
 2, 1, 74 /* Овчарук В.В. */, null, 56 /* Менеджмент  */),
(46, 20, null, 2,
 2, 1, 74 /* Овчарук В.В. */, null, 56 /* Менеджмент  */),

(46, 20, null, 1,
 2, 2, 74 /* Овчарук В.В. */, null, 90 /* Зовнішньоекономічна діяльн підпр */),
(46, 20, null, 2,
 2, 2, 74 /* Овчарук В.В. */, null, 90 /* Зовнішньоекономічна діяльн підпр */),

(46, 20, null, 1,
 2, 3, 14 /* Матіяш Т.О. */, null, 91 /* Господарське право */),
(46, 20, null, 2,
 2, 3, 14 /* Матіяш Т.О. */, null, 91 /* Господарське право */),

(46, 20, null, 1,
 2, 4, 72 /* Кайдановська О.М */, null, 92 /* Управління персоналом */),
(46, 20, null, 2,
 2, 4, 72 /* Кайдановська О.М */, null, 92 /* Управління персоналом */),


#        Wednesday
(46, 20, null, 1,
 3, 1, 72 /* Кайдановська О.М */, null, 87 /* Фінанси підприємства */),
(46, 20, null, 2,
 3, 1, 72 /* Кайдановська О.М */, null, 87 /* Фінанси підприємства */),

(46, 20, null, 1,
 3, 2, 74 /* Овчарук В.В. */, null, 90 /* Зовнішньоекономічна діяльн підпр */),
(46, 20, null, 2,
 3, 2, 74 /* Овчарук В.В. */, null, 90 /* Зовнішньоекономічна діяльн підпр */),

(46, 20, null, 1,
 3, 3, 75 /* Павлова М.Б */, null, 93 /* Логістика */),
(46, 20, null, 2,
 3, 3, 75 /* Павлова М.Б */, null, 93 /* Логістика */),


#        Thursday
(46, 20, null, 1,
 4, 1, 74 /* Овчарук В.В. */, null, 56 /* Менеджмент  */),
(46, 20, null, 2,
 4, 1, 74 /* Овчарук В.В. */, null, 56 /* Менеджмент  */),

(46, 20, null, 1,
 4, 2, 14 /* Матіяш Т.О. */, null, 91 /* Господарське право */),
(46, 20, null, 2,
 4, 2, 14 /* Матіяш Т.О. */, null, 91 /* Господарське право */),

(46, 20, null, 1,
 4, 3, 75 /* Павлова М.Б */, null, 93 /* Логістика */),
(46, 20, null, 2,
 4, 3, 75 /* Павлова М.Б */, null, 93 /* Логістика */),


#        Friday
(46, 20, null, 1,
 5, 1, 73 /* Качеровська Л.М */, null, 89 /* Інформаційні системи  */),
(46, 20, null, 2,
 5, 1, 73 /* Качеровська Л.М */, null, 89 /* Інформаційні системи  */),

(46, 20, null, 1,
 5, 2, 72 /* Кайдановська О.М */, null, 87 /* Фінанси підприємства */),
(46, 20, null, 2,
 5, 2, 72 /* Кайдановська О.М */, null, 87 /* Фінанси підприємства */)