# МЕ-172 (ауд.142а) = 47 21
INSERT INTO timetable (group_id, lesson_room_id, lesson_room_id_optional, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(47, 21, null, 1,
 1, 1, 76 /* Алєксєєнко В.Т */, null, 90 /* Зовнішньоекономічна діяльн підпр */),
(47, 21, null, 2,
 1, 1, 76 /* Алєксєєнко В.Т */, null, 90 /* Зовнішньоекономічна діяльн підпр */),

(47, 21, null, 1,
 1, 2, 72 /* Кайдановська О.М */, null, 87 /* Фінанси підприємства */),
(47, 21, null, 2,
 1, 2, 72 /* Кайдановська О.М */, null, 87 /* Фінанси підприємства */),

(47, 21, null, 1,
 1, 3, 73 /* Качеровська Л.М */, null, 89 /* Інформаційні системи  */),
(47, 21, null, 2,
 1, 3, 70 /* Бодарецька О.М */, null, 88 /* Управління інноваціями */),

(47, 21, null, 1,
 1, 4, 75 /* Павлова М.Б */, null, 93 /* Логістика */),
(47, 21, null, 2,
 1, 4, 75 /* Павлова М.Б */, null, 93 /* Логістика */),


#        Tuesday
(47, 21, null, 1,
 2, 1, 74 /* Овчарук В.В. */, null, 56 /* Менеджмент  */),
(47, 21, null, 2,
 2, 1, 74 /* Овчарук В.В. */, null, 56 /* Менеджмент  */),

(47, 21, null, 1,
 2, 2, 14 /* Матіяш Т.О. */, null, 91 /* Господарське право */),
(47, 21, null, 2,
 2, 2, 14 /* Матіяш Т.О. */, null, 91 /* Господарське право */),

(47, 21, null, 1,
 2, 3, 72 /* Кайдановська О.М */, null, 92 /* Управління персоналом */),
(47, 21, null, 2,
 2, 3, 72 /* Кайдановська О.М */, null, 92 /* Управління персоналом */),

(47, 21, null, 1,
 2, 4, 76 /* Алєксєєнко В.Т */, null, 90 /* Зовнішньоекономічна діяльн підпр */),
(47, 21, null, 2,
 2, 4, 76 /* Алєксєєнко В.Т */, null, 90 /* Зовнішньоекономічна діяльн підпр */),



#        Wednesday
(47, 21, null, 1,
 3, 1, 75 /* Павлова М.Б */, null, 93 /* Логістика */),
(47, 21, null, 2,
 3, 1, 75 /* Павлова М.Б */, null, 93 /* Логістика */),

(47, 21, null, 1,
 3, 2, 72 /* Кайдановська О.М */, null, 87 /* Фінанси підприємства */),
(47, 21, null, 2,
 3, 2, 72 /* Кайдановська О.М */, null, 87 /* Фінанси підприємства */),

(47, 21, null, 1,
 3, 3, 70 /* Бодарецька О.М */, null, 88 /* Управління інноваціями*/),
(47, 21, null, 2,
 3, 3, 70 /* Бодарецька О.М */, null, 88 /* Управління інноваціями*/),


#        Thursday
(47, 21, null, 1,
 4, 2, 74 /* Овчарук В.В. */, null, 56 /* Менеджмент  */),
(47, 21, null, 2,
 4, 2, 74 /* Овчарук В.В. */, null, 56 /* Менеджмент  */),

(47, 21, null, 1,
 4, 3, 14 /* Матіяш Т.О. */, null, 91 /* Господарське право */),
(47, 21, null, 2,
 4, 3, 14 /* Матіяш Т.О. */, null, 91 /* Господарське право */),



#        Friday
(47, 21, null, 1,
 5, 1, 72 /* Кайдановська О.М */, null, 87 /* Фінанси підприємства */),
(47, 21, null, 2,
 5, 1, 72 /* Кайдановська О.М */, null, 87 /* Фінанси підприємства */),

(47, 21, null, 1,
 5, 2, 73 /* Качеровська Л.М */, null, 89 /* Інформаційні системи  */),
(47, 21, null, 2,
 5, 2, 73 /* Качеровська Л.М */, null, 89 /* Інформаційні системи  */)


