# ПМ-172 (ауд.241) = 50 23
INSERT INTO timetable (group_id, lesson_room_id, lesson_room_id_optional, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(50, 23, null, 1,
 1, 1, 77 /* Докторук В.П. */, null, 99 /* Будова і обслуговування верстатів */),
(50, 23, null, 2,
 1, 1, 77 /* Докторук В.П. */, null, 99 /* Будова і обслуговування верстатів */),

(50, 23, null, 1,
 1, 2, 78 /* Логінов М.Г */, null, 107 /* Будова та налагодження СПУ */),
(50, 23, null, 2,
 1, 2, 78 /* Логінов М.Г */, null, 107 /* Будова та налагодження СПУ */),

(50, 23, null, 1,
 1, 3, 6 /* Малахова Н.Б.  */, null, 100 /* Соціологія */),
(50, 23, null, 2,
 1, 3, 6 /* Малахова Н.Б.  */, null, 100 /* Соціологія */),

(50, 23, null, 1,
 1, 4, 79 /* Громик О.М  */, null, 113 /* Економіка  */),
(50, 23, null, 2,
 1, 4, 79 /* Громик О.М  */, null, 113 /* Економіка  */),


#        Tuesday
(50, 23, null, 1,
 2, 1, 77 /* Докторук В.П.  */, null, 61 /* Технологічне оснащення  */),
(50, 23, null, 2,
 2, 1, 77 /* Докторук В.П.  */, null, 61 /* Технологічне оснащення  */),

(50, 23, null, 1,
 2, 2, 78 /* Логінов М.Г */, 80 /* Гордєєв О.А */, 95 /* Комп моделювання  */),
(50, 23, null, 2,
 2, 2, 78 /* Логінов М.Г */, 80 /* Гордєєв О.А */, 95 /* Комп моделювання  */),

(50, 23, null, 1,
 2, 3, 77 /* Докторук В.П.  */, null, 61 /* Технологічне оснащення  */),
(50, 23, null, 2,
 2, 3, 77 /* Докторук В.П.  */, null, 61 /* Технологічне оснащення  */),


#        Wednesday
(50, 23, null, 1,
 3, 1, 77 /* Докторук В.П. */, null, 99 /* Будова і обслуговування верстатів */),
(50, 23, null, 2,
 3, 1, 77 /* Докторук В.П. */, null, 99 /* Будова і обслуговування верстатів */),

(50, 23, null, 1,
 3, 2, 78 /* Логінов М.Г */, null, 107 /* Будова та налагодження СПУ */),
(50, 23, null, 2,
 3, 2, 78 /* Логінов М.Г */, null, 107 /* Будова та налагодження СПУ */),

(50, 23, null, 1,
 3, 3, 81 /* Старцун П.Р.  */, null, 26 /* Фізичне виховання */),
(50, 23, null, 2,
 3, 3, 81 /* Старцун П.Р.  */, null, 26 /* Фізичне виховання */),


#        Thursday
(50, 23, null, 1,
 4, 1, 77 /* Докторук В.П. */, null, 99 /* Будова і обслуговування верстатів */),
(50, 23, null, 2,
 4, 1, 77 /* Докторук В.П. */, null, 99 /* Будова і обслуговування верстатів */),

(50, 23, null, 1,
 4, 2, 78 /* Логінов М.Г */, 80 /* Гордєєв О.А */, 95 /* Комп моделювання  */),
(50, 23, null, 2,
 4, 2, 78 /* Логінов М.Г */, 80 /* Гордєєв О.А */, 95 /* Комп моделювання  */),

(50, 23, null, 1,
 4, 3, 77 /* Докторук В.П.  */, null, 61 /* Технологічне оснащення  */),
(50, 23, null, 2,
 4, 3, 77 /* Докторук В.П.  */, null, 61 /* Технологічне оснащення  */),

(50, 23, null, 1,
 5, 4, 81 /* Старцун П.Р.  */, null, 26 /* Фізичне виховання */),
(50, 23, null, 2,
 5, 4, 81 /* Старцун П.Р.  */, null, 26 /* Фізичне виховання */),


#        Friday
(50, 23, null, 1,
 5, 1, 78 /* Логінов М.Г */, null, 107 /* Будова та налагодження СПУ */),
(50, 23, null, 2,
 5, 1, 6 /* Малахова Н.Б.  */, null, 100 /* Соціологія */),


(50, 23, null, 1,
 5, 2, 79 /* Громик О.М  */, null, 113 /* Економіка  */),
(50, 23, null, 2,
 5, 2, 79 /* Громик О.М  */, null, 113 /* Економіка  */),

(50, 23, null, 1,
 5, 3, 78 /* Логінов М.Г */, 80 /* Гордєєв О.А */, 95 /* Комп моделювання  */),
(50, 23, null, 2,
 5, 3, 78 /* Логінов М.Г */, 80 /* Гордєєв О.А */, 95 /* Комп моделювання  */)


