# АТ-171 (ауд.239) = 51 24
INSERT INTO timetable (group_id, lesson_room_id, lesson_room_id_optional, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(51, 24, null, 1,
 1, 1, 82 /* Р */, null, 99 /* Основи автоматизованого проект */),
(51, 24, null, 2,
 1, 1, 82 /* Р */, null, 99 /* Основи автоматизованого проект */),

(51, 24, null, 1,
 1, 2, 79 /* Громик О.М  */, null, 103 /* Організація та планув підпр */),
(51, 24, null, 2,
 1, 2, 79 /* Громик О.М  */, null, 103 /* Організація та планув підпр */),

(51, 24, null, 1,
 1, 3, 83 /* Пірог Л.В.  */, null, 100 /* ТЕА */),
(51, 24, null, 2,
 1, 3, 83 /* Пірог Л.В.  */, null, 100 /* ТЕА */),


#        Tuesday
(51, 24, null, 1,
 2, 1, 84 /* Чернов К.В  */, null, 105 /* Основи технології ремонту автом  */),
(51, 24, null, 2,
 2, 1, 84 /* Чернов К.В  */, null, 105 /* Основи технології ремонту автом  */),

(51, 24, null, 1,
 2, 2, 85 /* Гадзира Л.М. */, 86 /* Хібліна К.І. */, 2 /* Іноземна мова  */),
(51, 24, null, 2,
 2, 2, 85 /* Гадзира Л.М. */, 86 /* Хібліна К.І. */, 2 /* Іноземна мова  */),

(51, 24, null, 1,
 2, 3, 81 /* Старцун П.Р.  */, null, 26 /* Фізичне виховання */),
(51, 24, null, 2,
 2, 3, 81 /* Старцун П.Р.  */, null, 26 /* Фізичне виховання */),

(51, 24, null, 1,
 2, 4, 6 /* Малахова Н.Б.  */, null, 100 /* Соціологія */),
(51, 24, null, 2,
 2, 4, 6 /* Малахова Н.Б.  */, null, 100 /* Соціологія */),


#        Wednesday
(51, 24, null, 1,
 3, 1, 83 /* Пірог Л.В.  */, null, 100 /* ТЕА */),
(51, 24, null, 2,
 3, 1, 83 /* Пірог Л.В.  */, null, 100 /* ТЕА */),

(51, 24, null, 1,
 3, 2, 84 /* Чернов К.В  */, null, 105 /* Основи технології ремонту автом  */),
(51, 24, null, 2,
 3, 2, 84 /* Чернов К.В  */, null, 105 /* Основи технології ремонту автом  */),

(51, 24, null, 1,
 3, 3, 82 /* Р */, null, 99 /* Основи автоматизованого проект */),
(51, 24, null, 2,
 3, 3, 79 /* Громик О.М  */, null, 103 /* Організація та планув підпр */),


#        Thursday
(51, 24, null, 1,
 4, 1, 82 /* Р */, null, 99 /* Основи автоматизованого проект */),
(51, 24, null, 2,
 4, 1, 82 /* Р */, null, 99 /* Основи автоматизованого проект */),

(51, 24, null, 1,
 4, 2, 83 /* Пірог Л.В.  */, null, 100 /* ТЕА */),
(51, 24, null, 2,
 4, 2, 83 /* Пірог Л.В.  */, null, 100 /* ТЕА */),

(51, 24, null, 1,
 4, 3, 85 /* Гадзира Л.М. */, 86 /* Хібліна К.І. */, 2 /* Іноземна мова  */),
(51, 24, null, 2,
 4, 3, 85 /* Гадзира Л.М. */, 86 /* Хібліна К.І. */, 2 /* Іноземна мова  */),

(51, 24, null, 1,
 4, 4, 6 /* Малахова Н.Б.  */, null, 100 /* Соціологія */),
(51, 24, null, 2,
 4, 4, 6 /* Малахова Н.Б.  */, null, 100 /* Соціологія */),


#        Friday
(51, 24, null, 1,
 5, 1, 81 /* Старцун П.Р.  */, null, 26 /* Фізичне виховання */),
(51, 24, null, 2,
 5, 1, 81 /* Старцун П.Р.  */, null, 26 /* Фізичне виховання */),

(51, 24, null, 1,
 5, 2, 84 /* Чернов К.В  */, null, 105 /* Основи технології ремонту автом  */),
(51, 24, null, 2,
 5, 2, 84 /* Чернов К.В  */, null, 105 /* Основи технології ремонту автом  */)
