# АТ-172 (ауд.222) = 52, 25,
INSERT INTO timetable (group_id, lesson_room_id, lesson_room_id_optional, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(52, 25, null, 1,
 1, 2, 83 /* Пірог Л.В.  */, null, 100 /* ТЕА */),
(52, 25, null, 2,
 1, 2, 83 /* Пірог Л.В.  */, null, 100 /* ТЕА */),

(52, 25, null, 1,
 1, 3, 79 /* Громик О.М  */, null, 103 /* Організація та планув підпр */),
(52, 25, null, 2,
 1, 3, 79 /* Громик О.М  */, null, 103 /* Організація та планув підпр */),

(52, 25, null, 1,
 1, 4, 82 /* Р */, null, 99 /* Основи автоматизованого проект */),
(52, 25, null, 2,
 1, 4, 82 /* Р */, null, 99 /* Основи автоматизованого проект */),


#        Tuesday
(52, 25, null, 1,
 2, 1, 83 /* Пірог Л.В.  */, null, 100 /* ТЕА */),
(52, 25, null, 2,
 2, 1, 83 /* Пірог Л.В.  */, null, 100 /* ТЕА */),

(52, 25, null, 1,
 2, 2, 84 /* Чернов К.В  */, null, 105 /* Основи технології ремонту автом  */),
(52, 25, null, 2,
 2, 2, 84 /* Чернов К.В  */, null, 105 /* Основи технології ремонту автом  */),

(52, 25, null, 1,
 2, 3, 6 /* Малахова Н.Б.  */, null, 100 /* Соціологія */),
(52, 25, null, 2,
 2, 3, 6 /* Малахова Н.Б.  */, null, 100 /* Соціологія */),

(52, 25, null, 1,
 2, 4, 81 /* Старцун П.Р.  */, null, 26 /* Фізичне виховання */),
(52, 25, null, 2,
 2, 4, 81 /* Старцун П.Р.  */, null, 26 /* Фізичне виховання */),


#        Wednesday
(52, 25, null, 1,
 3, 1, 84 /* Чернов К.В  */, null, 105 /* Основи технології ремонту автом  */),
(52, 25, null, 2,
 3, 1, 84 /* Чернов К.В  */, null, 105 /* Основи технології ремонту автом  */),

(52, 25, null, 1,
 3, 2, 85 /* Гадзира Л.М. */, 86 /* Хібліна К.І. */, 2 /* Іноземна мова  */),
(52, 25, null, 2,
 3, 2, 85 /* Гадзира Л.М. */, 86 /* Хібліна К.І. */, 2 /* Іноземна мова  */),

(52, 25, null, 1,
 3, 3, 79 /* Громик О.М  */, null, 103 /* Організація та планув підпр */),
(52, 25, null, 2,
 3, 3, 82 /* Р */, null, 99 /* Основи автоматизованого проект */),


#        Thursday

(52, 25, null, 1,
 4, 1, 83 /* Пірог Л.В.  */, null, 100 /* ТЕА */),
(52, 25, null, 2,
 4, 1, 83 /* Пірог Л.В.  */, null, 100 /* ТЕА */),

(52, 25, null, 1,
 4, 2, 85 /* Гадзира Л.М. */, 86 /* Хібліна К.І. */, 2 /* Іноземна мова  */),
(52, 25, null, 2,
 4, 2, 85 /* Гадзира Л.М. */, 86 /* Хібліна К.І. */, 2 /* Іноземна мова  */),

(52, 25, null, 1,
 4, 3, 6 /* Малахова Н.Б.  */, null, 100 /* Соціологія */),
(52, 25, null, 2,
 4, 3, 6 /* Малахова Н.Б.  */, null, 100 /* Соціологія */),

(52, 25, null, 2,
 4, 4, 82 /* Р */, null, 99 /* Основи автоматизованого проект */),


#        Friday
(52, 25, null, 1,
 5, 1, 84 /* Чернов К.В  */, null, 105 /* Основи технології ремонту автом  */),
(52, 25, null, 2,
 5, 1, 84 /* Чернов К.В  */, null, 105 /* Основи технології ремонту автом  */),

(52, 25, null, 1,
 5, 2, 81 /* Старцун П.Р.  */, null, 26 /* Фізичне виховання */),
(52, 25, null, 2,
 5, 2, 81 /* Старцун П.Р.  */, null, 26 /* Фізичне виховання */)