# МГ-171 (ауд.236) = 48, 26,
INSERT INTO timetable (group_id, lesson_room_id, lesson_room_id_optional, lesson_week,
                       day_number, lesson_number, teacher_id, teacher_id_optional, lesson_id)
VALUES
#        Monday
(48, 26, null, 1,
 1, 1, 36 /* Пахолюк О.В.  */, null, 26 /* Фізичне виховання */),
(48, 26, null, 2,
 1, 1, 36 /* Пахолюк О.В.  */, null, 26 /* Фізичне виховання */),

(48, 26, null, 1,
 1, 2, 87 /* Торопов Є.Є  */, null, 94 /* Технологія машинобудування */),
(48, 26, null, 2,
 1, 2, 87 /* Торопов Є.Є  */, null, 94 /* Технологія машинобудування */),

(49, 22, null, 1,
 1, 3, 78 /* Логінов М.Г */, 80 /* Гордєєв О.А */, 95 /* Комп моделювання  */),
(49, 22, null, 2,
 1, 3, 78 /* Логінов М.Г */, 80 /* Гордєєв О.А */, 95 /* Комп моделювання  */),

(48, 26, null, 1,
 1, 4, 88 /* Койфман А.М.  */, null, 96 /* Технологічні основи програмування */),
(48, 26, null, 2,
 1, 4, 88 /* Койфман А.М.  */, null, 96 /* Технологічні основи програмування */),


#        Tuesday
(48, 26, null, 1,
 2, 1, 87 /* Торопов Є.Є  */, null, 94 /* Технологія машинобудування */),
(48, 26, null, 2,
 2, 1, 87 /* Торопов Є.Є  */, null, 94 /* Технологія машинобудування */),

(48, 26, null, 1,
 2, 2, 87 /* Торопов Є.Є  */, null, 97 /* Осн автоматиз проектування */),
(48, 26, null, 2,
 2, 2, 87 /* Торопов Є.Є  */, null, 97 /* Осн автоматиз проектування */),

(48, 26, null, 1,
 2, 3, 88 /* Койфман А.М.  */, null, 96 /* Технологічні основи програмування */),
(48, 26, null, 2,
 2, 3, 88 /* Койфман А.М.  */, null, 96 /* Технологічні основи програмування */),

(49, 22, null, 1,
 2, 4, 78 /* Логінов М.Г */, 80 /* Гордєєв О.А */, 95 /* Комп моделювання  */),
(49, 22, null, 2,
 2, 4, 78 /* Логінов М.Г */, 80 /* Гордєєв О.А */, 95 /* Комп моделювання  */),


#        Wednesday
(48, 26, null, 1,
 3, 1, 87 /* Торопов Є.Є  */, null, 94 /* Технологія машинобудування */),
(48, 26, null, 2,
 3, 1, 87 /* Торопов Є.Є  */, null, 94 /* Технологія машинобудування */),

(48, 26, null, 1,
 3, 2, 87 /* Торопов Є.Є  */, null, 97 /* Осн автоматиз проектування */),
(48, 26, null, 2,
 3, 2, 87 /* Торопов Є.Є  */, null, 97 /* Осн автоматиз проектування */),

(48, 26, null, 1,
 3, 3, 72 /* Кайдановська О.М  */, null, 98 /* Основи управління виробництвом */),
(48, 26, null, 2,
 3, 3, 72 /* Кайдановська О.М  */, null, 98 /* Основи управління виробництвом */),


#        Thursday
(48, 26, null, 1,
 4, 1, 36 /* Пахолюк О.В */, null, 3 /* Фізична культура */),
(48, 26, null, 2,
 4, 1, 36 /* Пахолюк О.В */, null, 3 /* Фізична культура */),

(48, 26, null, 1,
 4, 2, 87 /* Торопов Є.Є  */, null, 94 /* Технологія машинобудування */),
(48, 26, null, 2,
 4, 2, 87 /* Торопов Є.Є  */, null, 94 /* Технологія машинобудування */),

(48, 26, null, 1,
 4, 3, 87 /* Торопов Є.Є  */, null, 97 /* Осн автоматиз проектування */),
(48, 26, null, 2,
4, 3, 79 /* Громик О.М  */, null, 113 /* Економіка  */),

(48, 26, null, 1,
 4, 4, 88 /* Койфман А.М.  */, null, 96 /* Технологічні основи програмування */),
(48, 26, null, 2,
 4, 4, 88 /* Койфман А.М.  */, null, 96 /* Технологічні основи програмування */),


#        Friday
(48, 26, null, 1,
 5, 1, 89 /* Матвєєв О.В  */, null, 114 /* Гідропневмоавтоматика */),
(48, 26, null, 2,
 5, 1, 89 /* Матвєєв О.В  */, null, 114 /* Гідропневмоавтоматика */),

(48, 26, null, 1,
 5, 2, 79 /* Громик О.М  */, null, 113 /* Економіка  */),
(48, 26, null, 2,
 5, 2, 79 /* Громик О.М  */, null, 113 /* Економіка  */)
